[
  {
    "title": "Helping Replit app owners get “unstuck” - free review if you’re stuck at 80%",
    "url": "https://reddit.com/r/replit/comments/1krewp9/helping_replit_app_owners_get_unstuck_free_review/",
    "author": "Living-Pin5868",
    "score": 25,
    "num_comments": 28,
    "created_utc": "2025-05-20T22:12:33",
    "selftext": "If you’re a business owner who built your app in Replit and it’s stuck at 80%… I get it.\nThat last bit payments, bug fixes, polish can drag on.\n\nI help people finish their apps and launch fast (without rewriting).\nIf you want, I’ll do a free mini-review and send back what’s blocking launch + how to fix it.\n\nNo catch. Just drop “stuck” and I’ll DM you a few questions.☺️\n",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.88,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "I need some help deciding whether replit is right for me",
    "url": "https://reddit.com/r/replit/comments/1j3ykyf/i_need_some_help_deciding_whether_replit_is_right/",
    "author": "Stunning-History-706",
    "score": 7,
    "num_comments": 44,
    "created_utc": "2025-03-05T09:33:04",
    "selftext": "My issue comes down to whether the $25/m plan has enough credits.\n\nMy doubt comes from the fact that the pricing page says **100 checkpoints.**  from my usage experience of the free-trial and general programming experience, 100 checkpoints is barely enough for 1 project.\n\n  \nfor example i ran out of the few checkpoints in the trial within an hour. makes me wonder whether i can even build a single app.\n\n  \nI want to use replit but i'm wondering whether a traditional assistant like windsurf might ...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.9,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help! Replit Is So Addicting!",
    "url": "https://reddit.com/r/replit/comments/1l6ie5f/help_replit_is_so_addicting/",
    "author": "nefermu",
    "score": 39,
    "num_comments": 19,
    "created_utc": "2025-06-08T19:56:25",
    "selftext": " I’m a no-code/low-code user, and having the ability to test all the ideas that have come to my mind over the past 20 years has been a total game changer. Being able to quickly try out my ideas is such a relief.\n\nThe only problem? I created over 10 apps just last week — but only deployed one. Every day I come up with more app ideas… it’s honestly addicting! and usage based charging kind a making me nervous. ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.95,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Built an MVP that helps men reduce the risk of prostate cancer",
    "url": "https://reddit.com/r/replit/comments/1l3gg81/built_an_mvp_that_helps_men_reduce_the_risk_of/",
    "author": "CommunicationReal495",
    "score": 15,
    "num_comments": 22,
    "created_utc": "2025-06-04T22:39:33",
    "selftext": "I'm really impressed with Replit agent lately. \n\nRecently came across a health article that claimed that men who release more frequently (21+ times/month) may significantly reduce their risk of prostate cancer.\n\nThis sparked the idea that lead to building this privacy focused PWA app that helps men track and gamify their release frequency as well as improve bedroom performance and mental clarity through the Kegel exercise and mood tracker built into the app. \n\nReplit is awesome and spits out rea...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "I helped someone launch on Replit. Super useful at first, but we had to move off it",
    "url": "https://reddit.com/r/replit/comments/1ki03c7/i_helped_someone_launch_on_replit_super_useful_at/",
    "author": "Living-Pin5868",
    "score": 42,
    "num_comments": 22,
    "created_utc": "2025-05-08T22:17:54",
    "selftext": "Just wanted to share something that might resonate with others here.\n\nI recently helped someone launch their app using Replit. Honestly, it was amazing in the beginning. We got the MVP up quickly, tested the idea, and even got some users onboard without touching a server or worrying about deployment.\n\nBut once things got real, problems started to show. Especially with Replit using the same database for both dev and production. That was risky. We had to move to a VPS, set up a proper database, an...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.98,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Someone who understands how to code I need help please.",
    "url": "https://reddit.com/r/replit/comments/1lajvp0/someone_who_understands_how_to_code_i_need_help/",
    "author": "Q_LyrX",
    "score": 2,
    "num_comments": 19,
    "created_utc": "2025-06-13T18:10:14",
    "selftext": "I was wondering if someone could help me out, I built a website for my brother barber business using Replit, deployed it everything work great except the site data and images load too slowly I used chat gpt to give me a prompt to fix it in Replit but the chat GPT prompt is asking for a lot of changes that I don’t know what they do since I am not a coder. I was wondering if anyone with basic coding experience could have a quick Look at this prompt and lmk if this is would fix my problem of the pe...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Built an MVP that helps developers get their AI coding assistants unstuck",
    "url": "https://reddit.com/r/replit/comments/1l3xp5d/built_an_mvp_that_helps_developers_get_their_ai/",
    "author": "Mission-Teaching-779",
    "score": 18,
    "num_comments": 17,
    "created_utc": "2025-06-05T14:16:35",
    "selftext": "I'm really impressed with what you can build when AI tools actually work properly.  \n  \nRecently got super frustrated with Replit AI, Cursor, and Claude getting stuck in loops and giving the same broken solutions repeatedly. Was burning through credits restarting projects constantly.  \n  \nThis sparked the idea to build CodeBreaker - a tool that gives developers proven prompts to reset AI thinking when it gets confused. Instead of restarting your whole coding session, you get specific prompts tha...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.88,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Replit Error - Please Help",
    "url": "https://reddit.com/r/replit/comments/1krmgzv/replit_error_please_help/",
    "author": "Even_Tumbleweed3229",
    "score": 2,
    "num_comments": 13,
    "created_utc": "2025-05-21T04:00:46",
    "selftext": "Whenever I use replit to make an app or continue working on one I keep running into this error, the only fix I have right now is switching to another device but eventually this same error appears again. Can someone please help me? The app seems to be a temporary fix. Thanks \n\n\\- I have Replit Core\n\n\\-Mainly uses Agent\n\n\\-Using API's(Open AI)\n\nhttps://preview.redd.it/avwfn69dl12f1.png?width=1360&amp;format=png&amp;auto=webp&amp;s=dcc505de7cba5f4d7b235aab6d43d1cd6ec54b49\n\n",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Replit App Help Needed: Ongoing Maintenance, PWA Testing, and iOS App Store Deployment",
    "url": "https://reddit.com/r/replit/comments/1l1iss1/replit_app_help_needed_ongoing_maintenance_pwa/",
    "author": "Andrescim",
    "score": 1,
    "num_comments": 11,
    "created_utc": "2025-06-02T16:01:19",
    "selftext": "I’m working on a calorie and macro tracking app built on Replit. It’s currently being tested as a PWA on iOS using the deployment link. I’m looking for help with ongoing maintenance, fixing bugs, and eventually getting it submitted to the App Store as a native iOS app.\n\nThe app is functional and live - just need someone experienced with Replit and comfortable supporting a project like this long-term. If you’ve worked on web-to-iOS projects before or know the App Store process, even better.\n\nBudg...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help Creating a Square External Payment Link for My Website",
    "url": "https://reddit.com/r/replit/comments/1l948i2/help_creating_a_square_external_payment_link_for/",
    "author": "jaimevargas86",
    "score": 3,
    "num_comments": 6,
    "created_utc": "2025-06-11T23:08:13",
    "selftext": "Hi everyone,\n\nI’m trying to add a payment option to my custom website that connects directly to my Square account. I already have a Square account set up for my business, and I want to create a simple external link (or embed, if needed) so customers can click “Order Now” or “Pay Here” and be taken directly to a secure Square checkout page tied to my business.\n\nI’ve looked into the Online Checkout feature in Square, but I’m having trouble figuring out how to generate a link that I can embed or at...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Reach out if you need help",
    "url": "https://reddit.com/r/replit/comments/1kjxlnp/reach_out_if_you_need_help/",
    "author": "xdrat",
    "score": 15,
    "num_comments": 9,
    "created_utc": "2025-05-11T12:04:50",
    "selftext": "Hi Replit,  \n  \nI've spent the last 2.5 years building a software to help digitize a sector in the transportation industry, been a part of a prestigious incubator (not YC), completed pilot projects, raised around 50k in initial funding (not too much but I spent enough time to learn the pitch deck / pitching game) and landed paying customers.\n\nLearned a lot but it's not really going anywhere. Last 6 months have felt very lonely and the mental struggle has been real. I graduated a year back, some ...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.94,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need help installing openai realtime api",
    "url": "https://reddit.com/r/replit/comments/1ldjtp0/need_help_installing_openai_realtime_api/",
    "author": "Nex_FN",
    "score": 1,
    "num_comments": 4,
    "created_utc": "2025-06-17T12:40:45",
    "selftext": "Hi there, I’m trying my best to use openai’s realtime API to create a speech to speech interview on my platform but I’m having difficulties getting it to work, I’ve installed the needed apps onto my replit and tried giving it all Information I could, but nothing seems to help. Any suggestions or experienced users who could help me add this onto my platform?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "I can help finish or scale your AI project",
    "url": "https://reddit.com/r/replit/comments/1kpcbrd/i_can_help_finish_or_scale_your_ai_project/",
    "author": "xerxen18",
    "score": 5,
    "num_comments": 7,
    "created_utc": "2025-05-18T07:10:24",
    "selftext": "I've been getting asked by friends and seeing a lot of posts on replit have a great idea that fizzle out when the AI generated code gets too complex, hallucinates, or if the code needs to scale more than replit can handle.\n\nI'm a fullstack dev working in crypto but ex-Apple where I've been helping fix projects for friends and private clients, especially with security in mind. I have built numerous end to end applications and platforms to scale with AWS, GCP, and Azure with kubernetes and more re...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.78,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help with Stripe Error Messages.",
    "url": "https://reddit.com/r/replit/comments/1jsico5/help_with_stripe_error_messages/",
    "author": "Grande_Fragrance",
    "score": 2,
    "num_comments": 13,
    "created_utc": "2025-04-06T02:56:11",
    "selftext": "I’m frustrated with Replit and Stripe. I keep getting this same message. I don’t think it’s a Stripe issue, but a Replit error.\n\n",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "Help with report export",
    "url": "https://reddit.com/r/replit/comments/1leqzg5/help_with_report_export/",
    "author": "BSD-CorpExec",
    "score": 1,
    "num_comments": 2,
    "created_utc": "2025-06-18T21:59:58",
    "selftext": "Hi All,\n\n  \nFor work I have built an app which is used to help with client engagements around data capture for their infrastructure requirements. I have tried to create exports which look identical to how the web page / data looks after an excel is ingested and uploaded but I cannot for the life of me figure out why I cant get a decent output. I have tried to tackle this from different angles and I've even tried SSH with Cursor to get a different result, plus uploading the entire app to ChatGPT ...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "App deployment - help!",
    "url": "https://reddit.com/r/replit/comments/1jo52y4/app_deployment_help/",
    "author": "Actual_Bug5507",
    "score": 1,
    "num_comments": 13,
    "created_utc": "2025-03-31T16:53:38",
    "selftext": "Hi guys,\n\nI’ve made an app that I want to deploy, so I can then make the app available on the App/Google Play stores. No matter how many times I try that deploy, I get an error message. I then ask the assistant to help fix the errors, they say they fix them…..but I get the errors again!\n\nIs there a human I can speak to so I can get this rectified? \n\nI’m not tech savvy, so already out of my comfort zone. I just want to get this thing deployed but really don’t understand why. I’ve attached a scree...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "Help with deleted files",
    "url": "https://reddit.com/r/replit/comments/1le87vq/help_with_deleted_files/",
    "author": "FeatureMysterious684",
    "score": 0,
    "num_comments": 2,
    "created_utc": "2025-06-18T06:33:32",
    "selftext": "I accidently deleted a folder not realizing my styles.css was in it and I cant seem to get back. Does anyone have a way to get it back?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help me please ?",
    "url": "https://reddit.com/r/replit/comments/1k2fb4t/help_me_please/",
    "author": "CompetitiveBar8856",
    "score": 3,
    "num_comments": 10,
    "created_utc": "2025-04-18T22:51:05",
    "selftext": "Can someone let me know what do I do. \nAm I cooked?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.81,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "I'm building an iGaming platform on Replit and need expert help integrating a Live Casino API + Sportsbook API.",
    "url": "https://reddit.com/r/replit/comments/1ld8wkn/im_building_an_igaming_platform_on_replit_and/",
    "author": "Ok_Paint_300",
    "score": 0,
    "num_comments": 2,
    "created_utc": "2025-06-17T02:04:33",
    "selftext": "ssues:\n\n* Token errors, wallet sync confusion, and callback handling for **Live Casino**\n* Complex data structure, bet placement failures, and odds updates for **Sportsbook**\n\nEven after reading the docs, full integration isn't working.\n\n💰 This is a **paid project** — looking for someone who can help me get it fully functional.\n\nDM me or reply if you're experienced with iGaming API integrations.",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Replit support is no help whatsoever.",
    "url": "https://reddit.com/r/replit/comments/1l8lz3v/replit_support_is_no_help_whatsoever/",
    "author": "ThoughtInternal7454",
    "score": 3,
    "num_comments": 2,
    "created_utc": "2025-06-11T08:55:13",
    "selftext": "I genuinely love Replit, but the support situation is honestly ridiculous. When you actually have a real problem, it’s like shouting into tho void. Who the hell is still relying on email-only support in 2025? At the very least, set up a proper support center, a Discord server like every other modern platform, or even a basic company contact number. It’s frustrating when a platform this good leaves users hanging.",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.72,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need help implementing video calls in my app – issues with Daily.co, Twilio, and Agora.io on Replit",
    "url": "https://reddit.com/r/replit/comments/1kw242p/need_help_implementing_video_calls_in_my_app/",
    "author": "lucascanovadickel",
    "score": 4,
    "num_comments": 4,
    "created_utc": "2025-05-26T20:44:27",
    "selftext": "Hey everyone,\n\nI’ve been trying to implement a video calling feature in my app, which I’m currently building and running on Replit. So far, I’ve tried using Daily.co, Twilio Video, and Agora APIs – but I haven’t been able to get any of them working properly in this environment.\n\nEach service either throws errors during initialization or fails to establish a stable connection. I suspect it might be related to some network restrictions or WebRTC issues within Replit’s hosted environment, but I hav...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.84,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Git help needed!",
    "url": "https://reddit.com/r/replit/comments/1lemrrg/git_help_needed/",
    "author": "Sad-Chocolate-2455",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-06-18T19:14:48",
    "selftext": "I’m not able to add my git repo as a remote in replit. Everytime I do it says “Error (Unknown) adding origin as a remote” has anyone also faced this? How did you solve?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Looking to hire someone to help with form submissions getting delivered (emailjs)",
    "url": "https://reddit.com/r/replit/comments/1l2iwvi/looking_to_hire_someone_to_help_with_form/",
    "author": "-Zeke-The-Geek-",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-06-03T20:04:35",
    "selftext": "Got some forms and form info I need to have sent to me when forms get completed. Looking for help lining out this emailjs I’m stuck. I am willing to switch off emailjs for a better option. \nI have very little coding experience, looking for someone that can eyeball my code please :)",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Little help needed, thanks",
    "url": "https://reddit.com/r/replit/comments/1jgywf6/little_help_needed_thanks/",
    "author": "call_me_annon",
    "score": 2,
    "num_comments": 13,
    "created_utc": "2025-03-22T03:59:01",
    "selftext": "Can anyone tell me how to fix this issue? I asked the agent and the bot to fix it, I tried myself to fix it, no luck. I know absolutely zero about coding. I added a few databases to my recent update and now it won’t deploy correctly. Explain to me like a 5 year old. \n\nThanks so much in advance.",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "Help... Anyone here willing to help me out with a project?",
    "url": "https://reddit.com/r/replit/comments/1l1kemy/help_anyone_here_willing_to_help_me_out_with_a/",
    "author": "Remarkable-North4540",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-06-02T17:05:33",
    "selftext": "Shameless cry for help.   \nI'm trying to make a webapp for scheduling paid sessions. Its a service business.  \nRight now I can't get users to be able to login and i'm in an AI death spiral.   \n  \nThank you!! ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help needed",
    "url": "https://reddit.com/r/replit/comments/1lbvh04/help_needed/",
    "author": "IntentionDull6589",
    "score": 0,
    "num_comments": 1,
    "created_utc": "2025-06-15T10:31:39",
    "selftext": "I've added the a, cname and txt records to namecheap as per instructions on Replit after deploying the websites I've built and they're not working.\n\nCan someone help me please? ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need help",
    "url": "https://reddit.com/r/replit/comments/1jm9w3u/need_help/",
    "author": "CompetitiveBar8856",
    "score": 5,
    "num_comments": 11,
    "created_utc": "2025-03-29T01:20:39",
    "selftext": "So I have been trying to make this app but this keeps on coming up I copied and pasted it to replit even though it says it’s fixed it still shows up. What do I do?\n",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "I am fed up with this bs , pls need help",
    "url": "https://reddit.com/r/replit/comments/1j8k9xt/i_am_fed_up_with_this_bs_pls_need_help/",
    "author": "i_am_the-thunder",
    "score": 6,
    "num_comments": 13,
    "created_utc": "2025-03-11T07:12:36",
    "selftext": "Like I gave the prompt to replit for a website and it appears to do lot of work and when it takes screen shots there is definitely a website there but why can I see it and it never loads I uses 1 query for prompt and other 5 for why everything is blank , if some body knows how to resolve this pls teach me",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.87,
    "is_self": false,
    "domain": "reddit.com"
  },
  {
    "title": "Would you use a platform that helps you make key startup decisions — like market entry or pricing — by analyzing your data and offering smart recommendations?",
    "url": "https://reddit.com/r/replit/comments/1l3hym4/would_you_use_a_platform_that_helps_you_make_key/",
    "author": "Thin-Appointment2064",
    "score": 5,
    "num_comments": 1,
    "created_utc": "2025-06-04T23:41:13",
    "selftext": "",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "[Hiring] Need help finalizing an AI app on Replit (Node.js + React + API integration)",
    "url": "https://reddit.com/r/replit/comments/1k97p3s/hiring_need_help_finalizing_an_ai_app_on_replit/",
    "author": "ReasonableWarthog129",
    "score": 3,
    "num_comments": 6,
    "created_utc": "2025-04-27T18:15:42",
    "selftext": "Hi everyone,\n\nI’m working on an AI-based character app hosted on Replit (Node.js + React). The core structure is already built. Here’s what I have completed:\n\n• Admin Dashboard for character management,\n• Character profiles created with uploaded images (profile and gallery photos ready),\n• Integrated Promptchan API for both chat and image generation,\n• Frontend and backend architecture already working together.\n\nWhat I need help with:\n\t•\tFinalizing the chat connection with Promptchan API (passin...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help how to prompt for a site of sites?",
    "url": "https://reddit.com/r/replit/comments/1l2yvzo/help_how_to_prompt_for_a_site_of_sites/",
    "author": "xmoneypowerx",
    "score": 0,
    "num_comments": 1,
    "created_utc": "2025-06-04T08:51:48",
    "selftext": "I want to create a site that links to microsite or mini apps. How could I go about creating this, linking to the apps and having URLs that look like part of the domain? E.g. I want to develop multiple micro apps. Say, calculator, calendar, todo lists, etc. I think I should create these as separate projects in replit. But I want to deploy as a single website with links to each individual project. \n\nAny suggestions how to best set this up and prompt, etc.?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "The site I made with replit won't let me click anything after deployment! Help!",
    "url": "https://reddit.com/r/replit/comments/1kpn4dq/the_site_i_made_with_replit_wont_let_me_click/",
    "author": "fireshaper",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-05-18T17:51:21",
    "selftext": "In the dev environment the site works great, but once I deploy it the cursor just quickly switches between the arrow and finger, clicking doesn't work, and on mobile when you tap a link it just flashes the link over and over. \n\nHas anyone seen this before? Chatgpt mentioned that this is because of vite but I don't know how to take it all out and replace it.",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help. I'm stuck in an error",
    "url": "https://reddit.com/r/replit/comments/1l0d52a/help_im_stuck_in_an_error/",
    "author": "Complex_Butterfly713",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-06-01T03:35:04",
    "selftext": "I started making an app, gave all the parameters that I wanted in it. Asked it to not do anything yet until we make sure it's what I want. Replit went back and forth with me for a bit to clarify some things, which I'm glad for bc I hadn't thought of some things.  Then I said let's go, and it started running for a couple of minutes then said it encountered an error and \"they're investigating the issue\" but it doesn't seem like it's doing anything.  What do I do now? just wait? Is it waiting for a...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help! Exporting Web App",
    "url": "https://reddit.com/r/replit/comments/1jz1jj4/help_exporting_web_app/",
    "author": "Away_Owl8983",
    "score": 3,
    "num_comments": 7,
    "created_utc": "2025-04-14T17:22:54",
    "selftext": "I have created a web app but now I feel like replit locked me in I’m using node.js and express, I’m currently using auto scale mode but like I have no use of postage db so I have no need for the high price of the deployment in replit, I’m looking for advise of how to do it correctly and to which host is recommended to deploy web apps, I’m cybersecurity researcher in my day to day life but I have no such depth knowledge unfortunately 🦫",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Free VPS need help",
    "url": "https://reddit.com/r/replit/comments/1l05wtf/free_vps_need_help/",
    "author": "Affectionate-Golf257",
    "score": 0,
    "num_comments": 1,
    "created_utc": "2025-05-31T21:51:26",
    "selftext": "I was planning on using replit for hosting a small python script, but I need something that uses User Datagram Protocol (UDP) instead of TCP.  I need it to be forever free, but not high performance.",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "The help section is useless. They haven't replied to my query for 2 weeks.",
    "url": "https://reddit.com/r/replit/comments/1kqq545/the_help_section_is_useless_they_havent_replied/",
    "author": "LengthinessOk3588",
    "score": 0,
    "num_comments": 2,
    "created_utc": "2025-05-20T01:12:04",
    "selftext": "",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Webhook unable to properly receive incoming posts. Any help?",
    "url": "https://reddit.com/r/replit/comments/1kc5edw/webhook_unable_to_properly_receive_incoming_posts/",
    "author": "bore-ito",
    "score": 1,
    "num_comments": 4,
    "created_utc": "2025-05-01T12:26:02",
    "selftext": "Just keep getting internal server errors. Using a flask server as created by the ai assistant. Been stuck for weeks trying to get this to work",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Replit and Lulu.com and Printful API Keys - HELP!",
    "url": "https://reddit.com/r/replit/comments/1k4gras/replit_and_lulucom_and_printful_api_keys_help/",
    "author": "MrYoshinobu",
    "score": 1,
    "num_comments": 5,
    "created_utc": "2025-04-21T17:49:38",
    "selftext": "I am not a coder at all, but I have been using Replit to create a Print-on-Demand (POD) website with so far, pretty good results.  My big problem is getting Replit to connect with my POD providers so I can start importing products into the website.  As a Shopify user, all I had to do was hit Connect on the merchant's website, point the merchant to my Shopify account, and it was connnected.  But given Replit is a more custom solution, the process seems more complicated.  \n\nWith both [Lulu.com](ht...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Replit error (please help)",
    "url": "https://reddit.com/r/replit/comments/1krvhz7/replit_error_please_help/",
    "author": "Aj8923",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-05-21T13:30:36",
    "selftext": "I'm currently working on a school project using Replit. I subscribed to the Core plan, and everything was working smoothly at first. However, I started experiencing issues when I tried using the AI assistant. After making changes and tapping \"Apply,\" it keeps saying \"nothing to commit,\" and the changes don’t go through.",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "DNS help",
    "url": "https://reddit.com/r/replit/comments/1k1dydm/dns_help/",
    "author": "CompetitiveBar8856",
    "score": 1,
    "num_comments": 5,
    "created_utc": "2025-04-17T16:18:57",
    "selftext": "So I bought a domain from network solutions and I finally deployed my app from Reddit. I followed the instructions and copied the A and Txt to my network solutions dns. For some reason it keeps on saying failed so I removed all dns from network solutions and tried again only having the A and TXT from replit. But it still showing up as failed.   \n\nWhat do I do?\nAm I cooked chat ? ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "Beginner Help: Trying to Make an Audio Message Wall in Replit (No Backend Experience)",
    "url": "https://reddit.com/r/replit/comments/1kpwf8d/beginner_help_trying_to_make_an_audio_message/",
    "author": "Effyyou",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-05-19T00:33:26",
    "selftext": "Hi everyone! I'm pretty new to Replit and coding in general, and I’m trying to make something fun and simple but I’m stuck.\n\n[https://bcw-app.replit.app/hotline.html](https://bcw-app.replit.app/hotline.html)\n\nI’m building a goofy wrestling-themed website for my buddies and I who get together to watch wrestling every week. I want to create a page where users can:\n\n* **Record or upload an audio message**\n* **Add their name and who the message is for**\n* **See a public list of past messages with au...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "I need help with authentication flows",
    "url": "https://reddit.com/r/replit/comments/1kca1o0/i_need_help_with_authentication_flows/",
    "author": "Leading-Pattern-4487",
    "score": 2,
    "num_comments": 3,
    "created_utc": "2025-05-01T16:26:10",
    "selftext": "I love this tool but I struggle HARD when it comes to having authentication flows. \n\nI’m trying to build a directory app that has two register/login flows for different user types. I tried registering and logging in but the app brings me back to the login screen. I can’t seem to prompt the agent to fix it. \n\nSomeone help?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need help with a from on a Replit made site",
    "url": "https://reddit.com/r/replit/comments/1jto3fe/need_help_with_a_from_on_a_replit_made_site/",
    "author": "milooosh",
    "score": 1,
    "num_comments": 6,
    "created_utc": "2025-04-07T17:31:21",
    "selftext": "Hey everyone, I've been trying for atleast 4 hours to get one form to submit and show the details on the same page yet to no success. Any of you willing to try and help me out ? I'm willing to pay if needed, thanks!",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "[error, please help] Failed to send agent prompt. Session creation failed.",
    "url": "https://reddit.com/r/replit/comments/1kn9472/error_please_help_failed_to_send_agent_prompt/",
    "author": "ActualSnoxcatko",
    "score": 2,
    "num_comments": 1,
    "created_utc": "2025-05-15T16:07:46",
    "selftext": "Hey so I've been getting this error today when I try to start building new app. I tried logging out and in again, tried to delete the cache and browsing data...nothing helps. Anyone know what might be the issue pleaase?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Replit and Lulu.com and Printful API Keys - HELP!",
    "url": "https://reddit.com/r/replit/comments/1k4gr7q/replit_and_lulucom_and_printful_api_keys_help/",
    "author": "MrYoshinobu",
    "score": 1,
    "num_comments": 4,
    "created_utc": "2025-04-21T17:49:23",
    "selftext": "I am not a coder at all, but I have been using Replit to create a Print-on-Demand (POD) website with so far, pretty good results.  My big problem is getting Replit to connect with my POD providers so I can start importing products into the website.  As a Shopify user, all I had to do was hit Connect on the merchant's website, point the merchant to my Shopify account, and it was connnected.  But given Replit is a more custom solution, the process seems more complicated.  \n\nWith both [Lulu.com](ht...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "How to get started with Replit if I only want to learn to code? (no AI help or suggestions)",
    "url": "https://reddit.com/r/replit/comments/1jf51bb/how_to_get_started_with_replit_if_i_only_want_to/",
    "author": "BeneficialSpace6369",
    "score": 2,
    "num_comments": 8,
    "created_utc": "2025-03-19T20:11:41",
    "selftext": "I just discovered about Replit thanks to a Python tutorial on Youtube by FreeCodeCamp.\n\n  \nAt the moment I want to learn about programming from the basics, so I started the C language course on Codecademy.\n\nBut I had difficulty installing an IDE on my laptop (like codeblocks or visual studio 2022) and it's cool to have a browser IDE like Replit because I could steal a moment or two at work on some other computer.\n\nAnyway, I was a bit disappointed to see that it's very centered on AI, as every se...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Replit first timer help!",
    "url": "https://reddit.com/r/replit/comments/1k8pkum/replit_first_timer_help/",
    "author": "Connect-Mechanic-858",
    "score": 2,
    "num_comments": 3,
    "created_utc": "2025-04-27T00:58:55",
    "selftext": "Hi All\n\nI spent the last few days trying to vibe code on Replit to create a booking software similar to Classpass/Mindbody (http://www.fiitflex.com/) with a decent amount of success I think... Would love to hear if any of you have time to have a quick gander and give me some advice.\n\nThe more pressing issue, however, is with getting email workflows integrated for verification and for notifications. I have given it my Sendgrid API's and set up the Godaddy email but I can't seem to get an email ou...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Pls help us with our robotics project",
    "url": "https://reddit.com/r/replit/comments/1kfbhup/pls_help_us_with_our_robotics_project/",
    "author": "Time-Bear-7556",
    "score": 1,
    "num_comments": 2,
    "created_utc": "2025-05-05T15:22:28",
    "selftext": "Hi everyone,\n\nWe are two robotics students who are VERY stuck on our supposedly easy project. Although it might sound like a piece of cake we have NO CLUE where to start and how to do this. Here are the instructions we were given by our teacher:\n\n Modify the given 2D perceptron code and make it be able to handle 3D training and testing data.  \nDeliverables:  \n1) A compressed (zip) file of your 3D perceptron project.  \n2) A shared link of your Replit project.  \n3) A Grapher (gcx) file of visualiz...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Rollback help",
    "url": "https://reddit.com/r/replit/comments/1k2luhh/rollback_help/",
    "author": "No_Thanks_6501",
    "score": 1,
    "num_comments": 4,
    "created_utc": "2025-04-19T04:14:35",
    "selftext": "So I've made a big mess of my app since the last deployment. How do I rollback my dev so I can start developing further since my last production deployment? ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Neep help with integrating perplexity/Open AI APIs to my app",
    "url": "https://reddit.com/r/replit/comments/1kqce0h/neep_help_with_integrating_perplexityopen_ai_apis/",
    "author": "Adventurous-Lie-9209",
    "score": 0,
    "num_comments": 0,
    "created_utc": "2025-05-19T15:59:04",
    "selftext": "Hi, As the title suggests, Have been building something on Replit for a while. However when I ask it to integrate it with different platforms like perplexity and Open AI, It doesn’t seem to be working. There is always some issue. i am from a non-coding background and could really use some help!",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Helping AI to be Better at Coding",
    "url": "https://reddit.com/r/replit/comments/1kat8do/helping_ai_to_be_better_at_coding/",
    "author": "Tim-Sylvester",
    "score": 3,
    "num_comments": 2,
    "created_utc": "2025-04-29T19:09:41",
    "selftext": "I’ve spent the last few weeks building a SaaS app boilerplate that’s built with, *and for*, vibe coding SaaS apps to help startups jump straight into a working app environment with auth, db, profiles, subscriptions, email marketing, user analytics, AI chat, in-app notifications, multi-tenant organization management and more, already *built, working, tested, known-good*.\n\nI started with Bolt and Lovable, but moved into Cursor (primarily using Gemini 2.5) after it got too big to be easy to work wi...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.8,
    "is_self": false,
    "domain": "medium.com"
  },
  {
    "title": "Replit wouldnt work correctly. Please help, i just wanna make stuff.",
    "url": "https://reddit.com/r/replit/comments/1jejgnx/replit_wouldnt_work_correctly_please_help_i_just/",
    "author": "KnownKing4874",
    "score": 2,
    "num_comments": 7,
    "created_utc": "2025-03-19T00:39:36",
    "selftext": "https://preview.redd.it/prwakxgtajpe1.png?width=1363&amp;format=png&amp;auto=webp&amp;s=b18ba63482c404f4b796a4581b2fe6c871d280e2\n\n",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "OBJECT-STORAGE how it works? please help",
    "url": "https://reddit.com/r/replit/comments/1i50t84/objectstorage_how_it_works_please_help/",
    "author": "Away-Cauliflower6693",
    "score": 3,
    "num_comments": 14,
    "created_utc": "2025-01-19T16:22:28",
    "selftext": "In my app people can upload / share files. Now everytime i deploy a version the files dont persistent. I found the 'Object Storage' option in tools. and now trying to use it.  Can  anyone help how to do it? as i have craeted a bucket and also install the package, but still the uploaded files are not stored in the bucket. can anybody help? I am non-tech person. ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Is anyone in need of an experienced software engineer to help improve and fix some bugs?",
    "url": "https://reddit.com/r/replit/comments/1k2hz4y/is_anyone_in_need_of_an_experienced_software/",
    "author": "Living-Pin5868",
    "score": 4,
    "num_comments": 3,
    "created_utc": "2025-04-19T00:52:57",
    "selftext": "I helped someone who is developing on Replit, and now we are deploying it to production.. \n\n🤘",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.83,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Please help - Webview not working",
    "url": "https://reddit.com/r/replit/comments/1jpua9b/please_help_webview_not_working/",
    "author": "Duddydude36",
    "score": 1,
    "num_comments": 5,
    "created_utc": "2025-04-02T19:23:51",
    "selftext": "I deleted my deployment and after that my webview stopped working.\n\nOn console It seems like its working correctly: Port :5000 opened on {...}.replit.dev, but when I click on that link that goes to the webview I get this message: server IP address could not be found.\n\nI was able to deploy again to my private domain but cant make webview/workspace work.\n\nPlease help, Ive been working on this project a lot",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Let’s Share Your Best Tips for Replit Below and Help Others! 🚀",
    "url": "https://reddit.com/r/replit/comments/1ib51qg/lets_share_your_best_tips_for_replit_below_and/",
    "author": "IllLiterature7562",
    "score": 17,
    "num_comments": 11,
    "created_utc": "2025-01-27T11:07:46",
    "selftext": "I’ll start with a tip I got from a friend:  \nIf you come across a problem that Replit’s AI agent can’t fix, try asking it to create a test script for the task you’re working on. Often, it will debug the script and refine it until the issue is resolved.\n\nWhat are your favorite tips or tricks for using Replit? Drop them in the comments below and let’s help each other out! 😊",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help with map",
    "url": "https://reddit.com/r/replit/comments/1k7gjwu/help_with_map/",
    "author": "beantown_brewery",
    "score": 2,
    "num_comments": 2,
    "created_utc": "2025-04-25T11:16:23",
    "selftext": "Any pointers on this would be appreciated!! I’m having trouble implementing a map into my app. I am trying to use a mapbox API code and replit is having trouble using it and just reverting 3JS and it looks bad. Any tips on how to fix?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help with Replit Agent",
    "url": "https://reddit.com/r/replit/comments/1gsdtep/help_with_replit_agent/",
    "author": "GenioCavallo",
    "score": 9,
    "num_comments": 20,
    "created_utc": "2024-11-16T03:55:15",
    "selftext": "The number of people who try Replit agent, get into a debugging cycle, get frustrated and give up is too large.  \nHow is it possible that as a non-coder I can build so much with a high rate of success. Perhaps it's the use cases? What y'all building that's not working?  \nWhat sort of prompts are you using?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Beginner Help - AI Images",
    "url": "https://reddit.com/r/replit/comments/1jel7wr/beginner_help_ai_images/",
    "author": "Fit-Flounder4437",
    "score": 1,
    "num_comments": 6,
    "created_utc": "2025-03-19T02:03:05",
    "selftext": "I have zero coding experience and i’ve been building a website for the past week. I don’t wanna give much info about it for privacy reasons but it is a car related website. I’ve been using the assistant to do all the coding for me and it’s been working great until i ask it to source free to use car pictures for my website. It is able to bring pictures in but they aren’t specific enough and aren’t always consistent. Does anyone else know a way i can get reliable accurate pictures without destroyi...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Having issues with your Replit app? I can help",
    "url": "https://reddit.com/r/replit/comments/1kgeavw/having_issues_with_your_replit_app_i_can_help/",
    "author": "Living-Pin5868",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-05-06T22:07:17",
    "selftext": "If you’re an entrepreneur or founder using Replit and keep running into problems like deployments not working, features breaking, or bugs that won’t go away. I can help you fix them.\n\nI’m a software engineer who’s handled a lot of tricky Replit setups, including apps that use agents or external APIs. If your app is stuck or you’re tired of running in circles, feel free to message me. I’ll take a look and see how I can help.\n\nTalk soon!",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.67,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need a bit of help",
    "url": "https://reddit.com/r/replit/comments/1jjgbbf/need_a_bit_of_help/",
    "author": "hmm_the_hmm",
    "score": 0,
    "num_comments": 5,
    "created_utc": "2025-03-25T11:34:36",
    "selftext": "Any idea why I can't download this as zip?\nI m using a mobile and I created this bot via using agent ai",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "Namecheap DNS help",
    "url": "https://reddit.com/r/replit/comments/1jsth33/namecheap_dns_help/",
    "author": "New-Organization618",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-04-06T14:55:00",
    "selftext": "Why does it seem the Namecheap DNS settings are troublesome with Replit? I'm literally stuck and no solution online",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Replit agent is not starting - need help",
    "url": "https://reddit.com/r/replit/comments/1k91cl3/replit_agent_is_not_starting_need_help/",
    "author": "cbsudux",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-04-27T13:00:47",
    "selftext": "https://preview.redd.it/g7w798ztzcxe1.png?width=3002&amp;format=png&amp;auto=webp&amp;s=4ad0dc1330a66f31abaa23595f6eeb8968b71b92\n\n  \nMy replit agent isn't starting and stuck in loading - it's the same across all apps I've started with agent. Unable to access agent in old apps. ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help with phone verification",
    "url": "https://reddit.com/r/replit/comments/1k8em3a/help_with_phone_verification/",
    "author": "MrGreekRetard",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-04-26T16:46:33",
    "selftext": "Can someone please tell me what to do about the phone verification?\nIt says my phone number is invalid or in use",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Seeking help with task on replit",
    "url": "https://reddit.com/r/replit/comments/1k1s7bg/seeking_help_with_task_on_replit/",
    "author": "Large-Explorer-1796",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-04-18T02:36:48",
    "selftext": "We have started creating a calendar app for gear rental inventory on replit. We have got the app to work nearly the way we want, but are running into a problem that we can’t seem to get around. In short, we are trying to block out multiple days on the calendar if the rental goes beyond one day, but can’t get it to visibly block off multiple days on the calendar for a single rental.\n\nWe are not coders, so we are looking for help from someone with more knowledge and experience with replit and/or c...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.67,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need help deploying replit project with Dokploy to VPS",
    "url": "https://reddit.com/r/replit/comments/1k6thad/need_help_deploying_replit_project_with_dokploy/",
    "author": "Dutchie07p",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-04-24T16:22:33",
    "selftext": "Heya guys,\n\n  \nI keep running into some issues.\n\nI've exported my project and opened it in cursor.\n\n  \nI've asked it to make a Dokerfile and using Dokploy on my vps installed to run it.\n\n  \nI upload my .zip file with Dockerfile made by cursor in it.\n\nSeems like i cant get it to work.\n\n  \nI would like to have someone help me, i will pay of course if u sure u can make it work.\n\nSent me a DM or post a reaction, ill DM you.\n\n(Preffered to connect to my anydesk)",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "looking for some help (paid)",
    "url": "https://reddit.com/r/replit/comments/1jlpng4/looking_for_some_help_paid/",
    "author": "Status-Membership775",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-03-28T08:32:33",
    "selftext": "I need to create a platform for vouchers which can generate qr codes and keep track of them and where I can add vendors and the database can be exported as an excel file. itll need a database for people to log in as well. If you think you are capable of it please hit me up with a quote!",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Hey hii, Can u Help me I have a reddit community for ai, I want people to join it , how can i make it popular i have tried many ways Like Dm many famous ones community and mods Posted in facebook but nothing worked even made a youtube video but it not worked am I making any mistakes???",
    "url": "https://reddit.com/r/replit/comments/1jlpres/hey_hii_can_u_help_me_i_have_a_reddit_community/",
    "author": "AmphibianMinimum3346",
    "score": 0,
    "num_comments": 3,
    "created_utc": "2025-03-28T08:41:23",
    "selftext": "Hey hii, Can u Help me, I have a reddit community for ai, I want people to join it how can I make it popular I have tried many ways\n\nLike Dm many famous ones community and mods Posted in facebook but nothing worked I even made a youtube video but it not worked\n\nLink of community: https://www.reddit.com/r/Al _Engineers100X/s/kTwK6P9FuW\n\nYoutube video link: https://youtu.be/sXzLChlocu8?si= VnhvOUwB4Q3bQFcW\n\nCan u tell where I am making mistakes",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.33,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help.... Replit installs random packages!",
    "url": "https://reddit.com/r/replit/comments/1jdu75t/help_replit_installs_random_packages/",
    "author": "AlreadyFriday",
    "score": 1,
    "num_comments": 2,
    "created_utc": "2025-03-18T02:55:47",
    "selftext": "This is the first time I have noticed this happening. I am asking the agent to fix a particular issue and it will start installing a package that is unrelated to the issue at hand. The first time it installed Twillo. I asked it why it installed Twillo and it answered, \"I apologize for the confusion with installing Twilio. That was an error on my part - I accidentally triggered the package installation while working on fixing the transcript cleanup display issue. There was no reasoning behind it,...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Anyone available to help build on replit",
    "url": "https://reddit.com/r/replit/comments/1idusp7/anyone_available_to_help_build_on_replit/",
    "author": "Ok-Entrepreneur-9658",
    "score": 2,
    "num_comments": 9,
    "created_utc": "2025-01-30T20:11:44",
    "selftext": "I've got a project in stuck on. The agent is also stuck in a loop. Anyone available to help me trouble shoot?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.67,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Get live engineering help to debug your Replit app",
    "url": "https://reddit.com/r/replit/comments/1jc59fc/get_live_engineering_help_to_debug_your_replit_app/",
    "author": "YesterdayDelicious67",
    "score": 12,
    "num_comments": 2,
    "created_utc": "2025-03-15T22:09:42",
    "selftext": "I'm hosting a debugging session now: [https://intake.expertondemand.co/](https://intake.expertondemand.co/) \\- will be live for the next 3 hours - bring your most frustrating bugs and I will help you debug live. The longer you're stuck on the bug, the more interested I am in it.",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need help bringing MVP to market with someone collaborating on Replit. (Non technical founder here)",
    "url": "https://reddit.com/r/replit/comments/1jb9dqg/need_help_bringing_mvp_to_market_with_someone/",
    "author": "thecargovanman",
    "score": 2,
    "num_comments": 3,
    "created_utc": "2025-03-14T18:26:36",
    "selftext": "So I’ve been building my MVP for my referral and reputation management application for sales organizations and home based service businesses to be able to create amazing and gamified referral and review competitions/contest to increase referral business and get better reviews for the business. There is also a built in CRM and reputation management system to manage Google and yelp reviews all in one.\n\nSo far, Replit has done an amazing job but I can see areas where it struggles and keeps looping ...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "I started a blog to help you build with AI—check it out!",
    "url": "https://reddit.com/r/replit/comments/1j8me41/i_started_a_blog_to_help_you_build_with_aicheck/",
    "author": "Traditional-Tip3097",
    "score": 5,
    "num_comments": 3,
    "created_utc": "2025-03-11T09:56:01",
    "selftext": "Hey everyone!\n\nI’ve been writing about creating software in the AI era through a product manager’s lens. If you’re interested in building with AI—whether you’re a founder, product manager, or just curious—this might be useful to you.\n\nI hope it helps you build with these new AI tools. \n\nCheck it out here:\n\nhttps://atomicbuilder.beehiiv.com/",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "I created World Time Explorer - an interactive web application that helps teams collaborate across time zones!",
    "url": "https://reddit.com/r/replit/comments/1jo8e6k/i_created_world_time_explorer_an_interactive_web/",
    "author": "Think-Strength-5764",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-03-31T19:11:51",
    "selftext": "🌍 Project Highlights:\nInteractive World Map: Click on any country to instantly see local time\nTime Comparison Tool: Easily compare times between two locations\nBusiness Hours Indicator: See if it's a good time to schedule meetings\nResponsive Design: Works seamlessly on desktop and mobile devices\n🛠️ Technical Details:\nFrontend: React with TypeScript, Tailwind CSS, and Shadcn UI components\nMap Visualization: React Simple Maps for interactive geography\nState Management: React Query for API data fetc...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "reddit.com"
  },
  {
    "title": "Geolocation error. Help!",
    "url": "https://reddit.com/r/replit/comments/1j8lb3e/geolocation_error_help/",
    "author": "MOGO-Hud",
    "score": 3,
    "num_comments": 3,
    "created_utc": "2025-03-11T08:29:31",
    "selftext": "I'm trying to build a simple app that uses the Google Maps API but it can't access the geolocation functionality. Does anyone else have the same issue?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "where to get help with 365 issue",
    "url": "https://reddit.com/r/replit/comments/1jkal04/where_to_get_help_with_365_issue/",
    "author": "dvr75",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-03-26T13:29:09",
    "selftext": "Hi,   \ni have created a web app with replit , there is an option to sign up and login with microsoft entra id which is working.  \nThe issue is when the use get into the dashboard , it does not bring data from 365 , and there is an error states i need to login again.  \nsomehow the token does not passed correctly , replit ai goes round and round trying to fix the issue , but comes up with the same solution which is not working.  \nhow can i get help ?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help: I added a Namecheap Domain deployed my replit app then did some changed to the app, now the old version is stuck on my Namecheap Domain",
    "url": "https://reddit.com/r/replit/comments/1jfftrt/help_i_added_a_namecheap_domain_deployed_my/",
    "author": "National_Raise_8367",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-03-20T04:25:32",
    "selftext": "Can someone help please? I have the domain that Replit provides, and I added my name cheap domain with the A and TXT added correctly. The name domain on Replit say verified. But no matter what desktop or phone I used if I type my domain in the Safari or browser the app comes up the old version. \n\nBut then I click the Replit.dev. Link next to the QR code on the web view of Riplit the correct version pops up, and I tried clearing the cache, etc. \n\nCan someone please help? I want to get the updated...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help with Federal to Private Jobs",
    "url": "https://reddit.com/r/replit/comments/1j0zic5/help_with_federal_to_private_jobs/",
    "author": "Inquisitivedesign",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-03-01T14:30:59",
    "selftext": "Hi guys, I got so excited to build this platform on my own, but Replit has been consistently failing. I’ve rebuilt the project several times and now, the agent can’t even get a start to the project right. I need to get this platform up for our federal employees. All the pieces are in place. Would someone like to come along and help me out? Paid deal.\n",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.67,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "help with email verification",
    "url": "https://reddit.com/r/replit/comments/1j0cfhc/help_with_email_verification/",
    "author": "Euphoric_Switch_475",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-02-28T17:57:30",
    "selftext": "so basically i want to use replit because it was recommended to me however whenever i use my email \"protonmail btw\" it dosent send the verification link to me ive tried everything does anyone have any suggestions as its really starting to annoy me.\n\nhttps://preview.redd.it/iz8wotlouwle1.png?width=540&amp;format=png&amp;auto=webp&amp;s=ee7fe5ec5dfefdaa65be793d0791119bb5a51f94\n\n",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "i added windsurf AI to my Replit workflow. it's helping me break out of agent feedback loops",
    "url": "https://reddit.com/r/replit/comments/1itg4l5/i_added_windsurf_ai_to_my_replit_workflow_its/",
    "author": "saasfatigue",
    "score": 10,
    "num_comments": 3,
    "created_utc": "2025-02-19T21:46:17",
    "selftext": "",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "youtube.com"
  },
  {
    "title": "Can anyone help me with Deployment, and operating on a standalone machine",
    "url": "https://reddit.com/r/replit/comments/1jl8e96/can_anyone_help_me_with_deployment_and_operating/",
    "author": "MacaroonJazzlike7408",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-03-27T17:44:22",
    "selftext": "Hey everyone I've been stuck trying to deploy my app and I can't get it to run. Seems to be stuck on Port issues, not configured correctly etc. It's on Auto. \n\nSecondly, if I wanted to run my application just from a standalone device, not even have it connected to servers/online, how could I do that?",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "[3/16] Get live engineering help to debug your Replit web app",
    "url": "https://reddit.com/r/replit/comments/1jcoyff/316_get_live_engineering_help_to_debug_your/",
    "author": "YesterdayDelicious67",
    "score": 2,
    "num_comments": 1,
    "created_utc": "2025-03-16T17:12:54",
    "selftext": "I'm hosting another debugging session: [https://meet.google.com/spb-squr-qtz](https://meet.google.com/spb-squr-qtz)  \\- bring your most frustrating bugs and I will help you debug live. The longer you're stuck on the bug, the more interested I am in it\n\nBook for next session here: [https://intake.expertondemand.co/](https://intake.expertondemand.co/)",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help: Frustrated with \"OverThinking\"",
    "url": "https://reddit.com/r/replit/comments/1h5hzy4/help_frustrated_with_overthinking/",
    "author": "Nitish_nc",
    "score": 2,
    "num_comments": 12,
    "created_utc": "2024-12-03T08:23:12",
    "selftext": "I purchased a Replit subscription an hour ago, and I hate to say this, but it feels like my money has gone down the drain. Why does Replit overthink when given direct instructions? Why does it take ages to execute the simplest changes?\n\nIs there a way to turn off this overthinking feature of the Replit Agent? Instead of being helpful, it's making things counterproductive. Even for the simplest CSS changes or design tweaks, it keeps \"thinking\" for minutes (God knows why), despite being given prop...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help! Newbie :)",
    "url": "https://reddit.com/r/replit/comments/1jj9g2n/help_newbie/",
    "author": "Few_Chipmunk2228",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-03-25T03:45:03",
    "selftext": "Hi! I am currently creating an app in replit and want to figure out the easiest way to take the code and have it deployed as a mobile application (iOS and Android). Is it through Echo? Any input would be great. I’ve seen a lot of comments similar in here and a lot of people saying it’s not possible … which I don’t think is true. Thanks! ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Urgent Help with Email sending issues",
    "url": "https://reddit.com/r/replit/comments/1jh551q/urgent_help_with_email_sending_issues/",
    "author": "Goodlasting",
    "score": 0,
    "num_comments": 0,
    "created_utc": "2025-03-22T11:02:41",
    "selftext": "\nThis is quite serious and urgent. I’ve created applications before in Replit and integrated SendGrid as my email gateway but my emails stopped working midway after I deployed my application. I checked SendGrid and I haven’t even come close to 1/3 of the free emails they’ve allocated. \nI created a new application and emails aren’t budging one bit. Replit has done tests and it receives status 200, meaning a success but I still can’t receive any emails. The email for the new app is properly config...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "My agent/site is in an endless loop of restarting the application and there’s nothing I can do. Please help!",
    "url": "https://reddit.com/r/replit/comments/1irvz8c/my_agentsite_is_in_an_endless_loop_of_restarting/",
    "author": "Slamjam555",
    "score": 3,
    "num_comments": 3,
    "created_utc": "2025-02-17T22:51:32",
    "selftext": "",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Hiring help for bug w/ firebase web notifications!!",
    "url": "https://reddit.com/r/replit/comments/1j7oqn2/hiring_help_for_bug_w_firebase_web_notifications/",
    "author": "allenspindle",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-03-10T03:44:15",
    "selftext": "I have a Replit project that I’ve been working on for around a month and a half and I’ve run into issues all of the time but I always solve them myself. Sometimes three or four hours sometimes two or three days. I have finally been stumped. Leveraging the best AI because I am not a coder, but do you have considerable software experience, I have spent at least 20+ hours with no luck even using Claude code beta, GPT0 one pro, Claude 3.7.\n\n\nProject is in node.JS with EJS. I set up Web notifications...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help me to Import Deployed Version in Workspace",
    "url": "https://reddit.com/r/replit/comments/1hvo360/help_me_to_import_deployed_version_in_workspace/",
    "author": "Away-Cauliflower6693",
    "score": 1,
    "num_comments": 7,
    "created_utc": "2025-01-07T10:53:32",
    "selftext": "I am unable to import the deployed version in my workspace. I have juggled with so many versions that I am unable to restore my current workspace version to my desired version which is already been deployed. Can anyone help? their support section sucks. ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need help - publishing an app.",
    "url": "https://reddit.com/r/replit/comments/1isivk5/need_help_publishing_an_app/",
    "author": "DwKschrute",
    "score": 3,
    "num_comments": 2,
    "created_utc": "2025-02-18T18:55:50",
    "selftext": "Hi, I am new to replit and loving it.  For context, I don't code, don't know how to code, and know nothing about this space.\n\nI found replit and started playing around with the agent to make an app. And voila, my app is born! I love it and would love to take it beyond the replit console.\n\nIdeally, I'd like to get it published on the app store or somewhere that I can have my friends and family use it too. I don't expect it to grow beyond that.\n\nMy questions to this community:\n1. If I make it publ...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Need help with validating feedbacks for school",
    "url": "https://reddit.com/r/replit/comments/1itzv6u/need_help_with_validating_feedbacks_for_school/",
    "author": "Anemptydesigner",
    "score": 0,
    "num_comments": 2,
    "created_utc": "2025-02-20T15:34:52",
    "selftext": "Hi there. I'm currently in my last semester of school. For one of my module assessments in product design, I was tasked with writing a needs-analysis essay featuring all research, validation, and solution proposals for disruptive software I am familiar with. I chose Replit after looking through Product Hunt and Reddit. I thought Replit might be a significant topic to dive into since the use case is wide for future users and could potentially be a market disruptor, such as myself, a UX designer t...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "GUYS HELP",
    "url": "https://reddit.com/r/replit/comments/1hiai3a/guys_help/",
    "author": "Healthy-Wishbone1471",
    "score": 0,
    "num_comments": 8,
    "created_utc": "2024-12-20T04:11:23",
    "selftext": "",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": false,
    "domain": "i.redd.it"
  },
  {
    "title": "Help",
    "url": "https://reddit.com/r/replit/comments/1is11lz/help/",
    "author": "Stormyfun79",
    "score": 2,
    "num_comments": 1,
    "created_utc": "2025-02-18T02:37:50",
    "selftext": "How do I get my apps back ",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": false,
    "domain": "v.redd.it"
  },
  {
    "title": "Looking for someone to help me build a golf Replit site. Please message me.",
    "url": "https://reddit.com/r/replit/comments/1irympg/looking_for_someone_to_help_me_build_a_golf/",
    "author": "Slamjam555",
    "score": 0,
    "num_comments": 1,
    "created_utc": "2025-02-18T00:44:19",
    "selftext": "",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "I created an app to help musicians count in their songs!",
    "url": "https://reddit.com/r/replit/comments/1itfh1l/i_created_an_app_to_help_musicians_count_in_their/",
    "author": "Ukawok92",
    "score": 2,
    "num_comments": 0,
    "created_utc": "2025-02-19T21:19:48",
    "selftext": "Hello!\n\nI have limited programming experience from when I was really into it in middle school and early highschool. These days my skillset is like how some people can understand French but can't speak it.\n\nSo I had an idea for an app and replit did a pretty damn good job helping me create it.\n\nIt's an app to help musicians during a performance.\n\nhttps://countinbuddy.com/\n\nA user can create a playlist and then add all the songs they will play in the performance. They will add the BPM and time sig...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.75,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help! I Keep getting stuck in restart loops using Automated Developer Agent",
    "url": "https://reddit.com/r/replit/comments/1ifh5w3/help_i_keep_getting_stuck_in_restart_loops_using/",
    "author": "chubs66",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-02-01T22:40:55",
    "selftext": "I've spent $25 since yesterday trying to get a mobile app built.  I started with incredible progress over the first hour (which was thrilling) but I keep getting stuck in server restart loops where it cannot bind to a port. The AI offers to try to bind to a different port, or to add more verbose logging, or to rewrite the code and add better error handling, or to try a different tech stack, or to use known working templates, or manual rollback but all of these quickly wind up in the same place: ...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Can Replit AI Help Me Build My MVP Android App?",
    "url": "https://reddit.com/r/replit/comments/1h8bmzt/can_replit_ai_help_me_build_my_mvp_android_app/",
    "author": "Musab_al",
    "score": 1,
    "num_comments": 6,
    "created_utc": "2024-12-06T22:01:26",
    "selftext": "Hi everyone,\n\nI’m new to Replit, and I’ve been exploring its potential for a personal project. I’m planning to build a light, simple MVP Android app—something not too complex—and I’m really intrigued by the idea of using Replit AI to assist me. Specifically, I’m curious if it’s possible to build the app primarily using natural language prompts.\n\nI’ve seen demos of Replit AI and how it can help with coding, but I’d love to hear from the community about your experiences. Has anyone tried building ...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Looking for help to complete my MVP (paid collaboration)",
    "url": "https://reddit.com/r/replit/comments/1hzk66s/looking_for_help_to_complete_my_mvp_paid/",
    "author": "Uchansichan",
    "score": 2,
    "num_comments": 2,
    "created_utc": "2025-01-12T11:45:23",
    "selftext": "Hi everyone!\n\nI’m building an MVP for a news aggregator with an interactive world map where users can hover over countries to see news headlines. I plan to use Perplexity API for fetching and summarizing the news.\n\nI need help to finish the project. Specifically, I’m looking for someone skilled in Replit, Python (FastAPI), and API integration to help me get everything running smoothly.\n\nThis is a paid opportunity, and I’m happy to discuss the compensation and details.\n\nIf you’re interested or ha...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "I need help my Replit is just a loading screen all my work is gone. ",
    "url": "https://reddit.com/r/replit/comments/1hrgm9w/i_need_help_my_replit_is_just_a_loading_screen/",
    "author": "National_Raise_8367",
    "score": 0,
    "num_comments": 3,
    "created_utc": "2025-01-02T01:13:18",
    "selftext": "I’ve been working on this app for a couple of weeks now. And I just logged in to my Replit and for a like 30 minutes Replit is loading. Usually my previous work will load back up and how much I already spent will pop up. Then the web view section would have a prompt that the agent is working and now it seems like the agent is disconnected. It says my app cannot be found.\n\nI’m afraid I lost my work but I didn’t do anything different. I added code that was made problems and errors occur, but befor...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 0.5,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help with App",
    "url": "https://reddit.com/r/replit/comments/1hqvkav/help_with_app/",
    "author": "Emotional_Mall1602",
    "score": 1,
    "num_comments": 2,
    "created_utc": "2025-01-01T05:25:57",
    "selftext": "Hi all,\n\nIm creating an app that takes information from a user around thier business and then customises a google slide doc based on thier inputs. \n\nThe idea is (i think simple)\n\n1. Fact find on the business, get all the information needed to be accross the key areas that need to be customised.\n2. Train an inbuild Chat model (claude) on the information, it will then be reworded based on communication frameworks ive got handy and methodologies that the agent has been tained on.\n3. Spits out a cus...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  },
  {
    "title": "Help with Claude Opus Integration History",
    "url": "https://reddit.com/r/replit/comments/1hpo59n/help_with_claude_opus_integration_history/",
    "author": "Overall-Log3374",
    "score": 1,
    "num_comments": 2,
    "created_utc": "2024-12-30T15:17:45",
    "selftext": "Hi All,\n\nHopefully someone can help or if there is a developer I can pay to do this as REPLIT is having none of it.\n\n  \nI have created a chat interface within a page and connected to claude opus. Is all works find but getting getting error galore add the below:\n\n  \nEnhance the conversation flow with contextual awareness\n\n  \nAt the moment I ask it a question and it forgets the conversation so I cannot question the response from the ai.\n\n  \nI have attached the page.\n\n  \nAny help would be great. I ...",
    "subreddit": "replit",
    "search_term": "help",
    "upvote_ratio": 1.0,
    "is_self": true,
    "domain": "self.replit"
  }
]